using System;

// 1. Describe the strings in C#. What is typical for the string data type?
//    Describe the most important methods of the String class.

namespace _1_StringDescribe
{
    class StringDescribe
    {
        static void Main()
        {
            // string e клас за обработка на символни низове. 
            //
            // Той пази символния низ
            // като char[] и е неизменим. string е и вграден референтен тип данни, 
            // който е и сложен тип данни. 
            //
            // Copy(); Връща копие на низа за да работиш с него и оригинала да не се
            // променя.
            // Equals(); - Проверява за еднаквост на два низа.
            // Contains(); - Проверява стринга съдържа ли подстринга подаден като параметър. 
            // IndexOf();  - Връща индекса на стринга или символа подаден като параметър.
            // Split(); - Връща масив от поднизове от дадения низ взети по подаден разделител.
            // Substring(); - Връша подстринг по даено начало до дадена дължина или до края.
            // Trim(); - Премахва празните символи в началото и края на низа. 
        }
    }
}
